---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.ReturnAirflowType
source: html/9d22c44b-d7b9-ba3f-3e3c-67ff1cf7156b.htm
---
# Autodesk.Revit.DB.Mechanical.ReturnAirflowType

An enumerated type listing all the possible return airflow types for a space object.

## Syntax (C#)
```csharp
public enum ReturnAirflowType
```